{
  "context": "Returning to his Galilean hometown, Jesus teaches in the synagogue, echoing prophetic patterns of rejected messengers—recalling Jeremiah’s lament (Jer 11) and Isaiah’s astonishment (Isa 6). Matthew frames the scene against Israel’s covenant memory, spotlighting wisdom and power confronting familiar unbelief.",
  "title": "Matthew 13:56",
  "subtitle": "Greek Word-by-Word Breakdown",
  "table": [
    ["Greek", "Translit.", "Gloss"],
    ["Καὶ", "Kai", "and"],
    ["ἐλθὼν", "elthōn", "having come"],
    ["εἰς", "eis", "into"],
    ["τὴν", "tēn", "the (fem. acc.)"],
    ["πατρίδα", "patrida", "homeland"],
    ["αὐτοῦ", "autou", "his"],
    ["ἐδίδασκεν", "edidasken", "was teaching"],
    ["αὐτοὺς", "autous", "them"],
    ["ἐν", "en", "in"],
    ["τῇ", "tē", "the (fem. dat.)"],
    ["συναγωγῇ", "synagōgē", "synagogue"],
    ["αὐτῶν", "autōn", "their"],
    ["ὥστε", "hōste", "so that"],
    ["ἐκπλήσσεσθαι", "ekplēssesthai", "to be astonished"],
    ["αὐτοὺς", "autous", "them"],
    ["καὶ", "kai", "and"],
    ["λέγειν", "legein", "to say"],
    ["Πόθεν", "Pothen", "from where?"],
    ["τούτῳ", "toutō", "to this one"],
    ["ἡ", "hē", "the (fem. nom.)"],
    ["σοφία", "sophia", "wisdom"],
    ["αὕτη", "hautē", "this"],
    ["καὶ", "kai", "and"],
    ["αἱ", "hai", "the (fem. nom. pl.)"],
    ["δυνάμεις", "dynameis", "powers"]
  ],
  "entries": [
    "<b>ἐκπλήσσεσθαι</b> (ekplēssesthai) – \"to be utterly astonished\n• <i>Etymology</i>: Compound of ἐκ \"out of\" + πλήσσω \"to strike,\" from PIE *pleh₂k- \"hit; beat.\" The imagery evokes being knocked outside one’s senses; Hebrew נָהַם and Akkadian palāḫ share the shock-fear semantic field.\n• <i>NT Usage</i>: Appears 13×; crowds hearing Jesus (Mk 1:22) or witnessing resurrection authority (Mt 7:28) react with startled awe. Luke highlights the verb to stress prophetic speech that provokes decision.\n• <i>LXX Usage</i>: Ps 48:6 LXX depicts nations \"struck with terror\" at divine ascent, while Is 13:8 likens dread to labor pains—texts framing Matthew’s eschatological astonishment motif.\n• <i>Classical</i>: Herodotus Hist. 8.11 and Euripides Phoen. 1083 employ ἐκπλήσσω for battlefield panic and tragic dread, extending semantic range from wonder to paralysis.\n• <i>Aramaic Root</i>: Galilean תְּמַהּ conveys marvel tinged with doubt; the Peshitta renders the verb with דܰܡܗܳ, confirming cultural continuity between Semitic astonishment and Greek expression.",
    "<b>σοφία</b> (sophia) – \"skillful wisdom, applied insight\n• <i>Etymology</i>: From σοφός \"wise, skilled,\" perhaps linked to PIE *sap- \"to taste, discern,\" paralleling Hebrew חָכְמָה ḥokmāh that couples craftsmanship with ethical prudence.\n• <i>NT Usage</i>: 51×; Matthew joins wisdom with mighty works (13:54) and personifies it (11:19), fusing Christology and sapiential tradition.\n• <i>LXX Usage</i>: Dominant in Proverbs and Wisdom of Solomon; Ex 31:3 grants Bezalel \"spirit of σοφία,\" foreshadowing the carpenter-Messiah’s creative authority.\n• <i>Classical</i>: Plato Phaedr. 247c treats σοφία as recollection of forms, while Thucydides Hist. 1.84 praises Pericles’ \"practical σοφία,\" showing elasticity between metaphysics and politics.\n• <i>Aramaic Root</i>: חָכְמָא ḥakmā in Targums denotes both scribal expertise and eschatological discernment; 1 Enoch 5:8 promises inheritance to the wise, resonating with Matthean discipleship.",
    "<b>δυνάμεις</b> (dynameis) – \"powers, mighty works\n• <i>Etymology</i>: Plural of δύναμις, from δύναμαι \"be able,\" PIE *dewh₂- \"do, be strong,\" overlapping Hebrew גְּבוּרוֹת gevurot \"mighty deeds.\"\n• <i>NT Usage</i>: 38× plural; synoptics pair wisdom and powers (Mk 6:2) as evidence of the kingdom. Paul contrasts worldly λόγος with πνευματικαὶ δυνάμεις (1 Cor 12), stressing charismata.\n• <i>LXX Usage</i>: Ps 106:2 calls Israel to proclaim God’s δυνάμεις; Dan 4:30 attributes universal rule to divine δύναμις, priming readers for Christ’s miracle-authority.\n• <i>Classical</i>: Aristotle Metaph. 1046a locates physical change in latent δυνάμεις; Polybius Hist. 1.4 denotes military forces, indicating capacity for decisive action mirrored in gospel healings.\n• <i>Aramaic Root</i>: חֵילִין ḥêlīn \"powers\" in Daniel Aramaic and Jewish liturgy denotes angelic hosts and miracles; Jesus’ exorcisms evoke this apocalyptic backdrop.\n• <i>Patristic Insight</i>: Origen Cels. 2.48 links Nazareth’s query to Isa 11:2’s spirit of might, arguing unbelief blinds one to evident δυνάμεις.",
    "<b>πατρίδα</b> (patrida) – \"fatherland, ancestral home\n• <i>Etymology</i>: Accusative of πατρίς, from πατήρ \"father,\" PIE *pəter-; connotes land defined by paternal lineage. Hebrew אֶרֶץ אַבוֹת ’eretz avot mirrors covenant inheritance.\n• <i>NT Usage</i>: Appears chiefly in rejection narratives (Mt 13:54; Mk 6:1; Jn 4:44). Homeland becomes the arena where kinship expectations collide with prophetic vocation, prefiguring broader Israelite resistance.\n• <i>LXX Usage</i>: Gen 31:3 urges Jacob \"return to your πατρίδα,\" merging geography and mission; Ruth 2:11 lauds loyalty in leaving one’s πατρίδα, a foil to Nazareth’s skepticism.\n• <i>Classical</i>: Homer Od. 1.58 yearns for \"πατρίδα γαῖαν.\" Demosthenes Or. 18 laments betrayal of the πατρίς, infusing the term with civic emotion and honor-shame stakes.\n• <i>Aramaic Root</i>: Targumic אַרְעָא דְּאוּמַיֵּה \"land of his people\" preserves filial nuance; 1 QHa 12.25 describes relinquishing homeland to pursue divine wisdom.\n• <i>Sociological Note</i>: Second-Temple villagers identified by clan plots; Jesus’ refusal to exploit patronage obligations destabilizes honor expectations encoded in πατρίδα.",
    "<b>συναγωγῇ</b> (synagōgē) – \"assembly, synagogue\n• <i>Etymology</i>: From σύν \"together\" + ἄγω \"lead\"; basic sense \"gathering.\" Hebrew קְהָל and עֲדָה relate, yet by Second Temple era συναγωγῇ denotes both congregation and building.\n• <i>NT Usage</i>: 56×; Matthew presents it as venue of teaching (4:23; 13:54) and persecution (10:17), portraying Jesus as Torah-faithful yet eschatological teacher.\n• <i>LXX Usage</i>: Lev 23:3 renders מִקְרָא קֹדֶשׁ \"holy convocation\" with συναγωγή; Ps 106:32 praises God \"in the συναγωγῇ of elders,\" uniting worship and wisdom.\n• <i>Classical</i>: Rare outside Jewish milieu; Strabo Geo. 16.2.37 describes \"συναγωγαί\" as communal halls, showing Hellenistic adaptation of Jewish public space within Greco-Roman cities.\n• <i>Aramaic Root</i>: בֵּית כְּנִישְׁתָּא \"house of assembly\" appears in inscriptions; Galilean Aramaic alternates the loanword and native term interchangeably.\n• <i>Dead Sea Scrolls</i>: 1QS 6.1’s \"community assembly\" (מועדה) predates synagogue liturgy, suggesting Qumran influence on early synagogue order later reflected in Luke 4 and Matthew 13."
  ],
  "source": "Nestle-Aland 28"
}
